pipeShellThermal/thermoFoam/0.orig/T
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2412                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      T;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 1 0 0 0];

internalField   uniform 250;

boundaryField
{
    "(inlet|outlet)"
    {
        type            empty;
    }

    outerWall
    {
        type            fixedValue;
        value           uniform 200;
    }

    innerWall
    {
        type            fixedValue;
        value           uniform 300;
    }

    // innerWall
    // {
    //     type            fixedGradient;
    //     gradient        uniform 52e3;
    //     value           uniform 300;
    // }
}


// ************************************************************************* //
